{"votes": {"funny": 0, "useful": 5, "cool": 2}, "user_id": "rLtl8ZkDX5vH5nAx9C3q5Q", "review_id": "fWKvX83p0-ka4JS3dc6E5A", "stars": 5, "date": "2011-01-26", "text": "My wife took me here on my birthday for breakfast and it was excellent.  The weather was perfect which made sitting outside overlooking their grounds an absolute pleasure.  Our waitress was excellent and our food arrived quickly on the semi-busy Saturday morning.  It looked like the place fills up pretty quickly so the earlier you get here the better.\n\nDo yourself a favor and get their Bloody Mary.  It was phenomenal and simply the best I've ever had.  I'm pretty sure they only use ingredients from their garden and blend them fresh when you order it.  It was amazing.\n\nWhile EVERYTHING on the menu looks excellent, I had the white truffle scrambled eggs vegetable skillet and it was tasty and delicious.  It came with 2 pieces of their griddled bread with was amazing and it absolutely made the meal complete.  It was the best \"toast\" I've ever had.\n\nAnyway, I can't wait to go back!", "type": "review", "business_id": "9yKzy9PApeiPPOUJEtnvkg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0a2KyEL0d3Yb1V6aivbIuQ", "review_id": "IjZ33sJrzXqU-0X6U8NwyA", "stars": 5, "date": "2011-07-27", "text": "I have no idea why some people give bad reviews about this place. It goes to show you, you can please everyone. They are probably griping about something that their own fault...there are many people like that.\n\nIn any case, my friend and I arrived at about 5:50 PM this past Sunday. It was pretty crowded, more than I thought for a Sunday evening and thought we would have to wait forever to get a seat but they said we'll be seated when the girl comes back from seating someone else. We were seated at 5:52 and the waiter came and got our drink orders. Everyone was very pleasant from the host that seated us to the waiter to the server. The prices were very good as well. We placed our orders once we decided what we wanted at 6:02. We shared the baked spaghetti calzone and the small \"Here's The Beef\" pizza so we can both try them. The calzone was huge and we got the smallest one (personal) and got the small 11\" pizza. Both were awesome! My friend liked the pizza better and I liked the calzone better. The calzone does have a sweetish sauce but that's how I like my sauce!\n\nWe had to box part of the pizza to take it home and we were out the door by 6:42. So, everything was great and not like these bad reviewers. That goes to show you that  you have to try these things yourself because all these bad reviewers have some serious issues.", "type": "review", "business_id": "ZRJwVLyzEJq1VAihDhYiow"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "0hT2KtfLiobPvh6cDC8JQg", "review_id": "IESLBzqUCLdSzSqm0eCSxQ", "stars": 4, "date": "2012-06-14", "text": "love the gyro plate. Rice is so good and I also dig their candy selection :)", "type": "review", "business_id": "6oRAC4uyJCsJl1X0WZpVSA"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "uZetl9T0NcROGOyFfughhg", "review_id": "G-WvGaISbqqaMHlNnByodA", "stars": 5, "date": "2010-05-27", "text": "Rosie, Dakota, and I LOVE Chaparral Dog Park!!! It's very convenient and surrounded by a lot of paths, a desert xeriscape, baseball fields, ballparks, and a lake with ducks.\n\nThe Scottsdale Park and Rec Dept. does a wonderful job of keeping the park clean and shaded.  You can find trash cans and poopy-pick up mitts located all over the park and paths.\n\nThe fenced in area is huge to let the dogs run, play, and sniff!", "type": "review", "business_id": "_1QQZuf4zZOyFCvXc0o6Vg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "vYmM4KTsC8ZfQBg-j5MWkw", "review_id": "1uJFq2r5QfJG_6ExMRCaGw", "stars": 5, "date": "2012-01-05", "text": "General Manager Scott Petello is a good egg!!! Not to go into detail, but let me assure you if you have any issues (albeit rare) speak with Scott and treat the guy with some respect as you state your case and I'd be surprised if you don't walk out totally satisfied as I just did. Like I always say..... \"Mistakes are inevitable, it's how we recover from them that is important\"!!!\n\nThanks to Scott and his awesome staff. You've got a customer for life!! .......... :^)", "type": "review", "business_id": "6ozycU1RpktNG2-1BroVtw"}
{"votes": {"funny": 1, "useful": 3, "cool": 4}, "user_id": "sqYN3lNgvPbPCTRsMFu27g", "review_id": "m2CKSsepBCoRYWxiRUsxAg", "stars": 4, "date": "2007-12-13", "text": "Quiessence is, simply put, beautiful.  Full windows and earthy wooden walls give a feeling of warmth inside this restaurant perched in the middle of a farm.  The restaurant seemed fairly full even on a Tuesday evening; we had secured reservations just a couple days before.\n\nMy friend and I had sampled sandwiches at the Farm Kitchen earlier that week, and were impressed enough to want to eat at the restaurant.  The crisp, fresh veggies didn't disappoint: we ordered the salad with orange and grapefruit slices and the crudites to start.  Both were very good; I didn't even know how much I liked raw radishes and turnips until I tried them with their pesto and aioli sauces.\n\nFor entrees, I ordered the lamb and my friend ordered the pork shoulder.  Service started out very good, but trailed off quickly.  Waiting for our food took a very long time (a couple seated after us received and finished their entrees before we received our's), and no one bothered to explain the situation until the maitre'd apologized almost 45 minutes later.  Apparently the chef was unhappy with the sauce on my entree, so he started anew.  This isn't really a problem, but they should have communicated this to us earlier.  For our troubles, they comped me the glass of wine I ordered, but they forgot to bring out with my entree  as I had requested.  Also, they didn't offer us bread, but I will echo the lady who whispered this to us on her way out: ask for the bread.  We received warm foccacia, apple walnut, and pomegranate slices of wonder with honey and butter.  YUM.\n\nThe entrees were both solid, but didn't quite live up to the innovation and freshness of the vegetables.  My lamb's sauce was delicious, but the meat was tough.  Maybe the vegetarian entrees are the way to go?  But our dessert, the gingerbread pear cake, was yet another winner.\n\nIf the entrees were tad more inspired, or the service weren't so spotty, this place definitely would have warranted five stars.  If I return, I'd like to try the 75$ tasting menu.  Our bill came out to about 100$ for two people, including tip, no drinks.", "type": "review", "business_id": "-yxfBYGB6SEqszmxJxd97A"}
{"votes": {"funny": 4, "useful": 7, "cool": 7}, "user_id": "wFweIWhv2fREZV_dYkz_1g", "review_id": "riFQ3vxNpP4rWLk_CSri2A", "stars": 5, "date": "2010-02-12", "text": "Drop what you're doing and drive here. After I ate here I had to go back the next day for more.  The food is that good.\n\nThis cute little green building may have gone competely unoticed if I hadn't been driving down Palm Rd to avoid construction.  While waiting to turn onto 16th Street the \"Grand Opening\" sign caught my eye and my little yelping soul leaped for joy!  A new place to try!\n\nIt looked desolate from the outside but when I opened the door I was put at easy by the decor, smell and cleanliness inside.  I ordered dinner for two, to go.  The menu was awesome.  I loved seeing all the variety: poblano peppers, mole, mahi mahi, mushrooms...something wrapped in banana leaves.  It made it difficult to choose something.  Here's what I've had so far: La Condesa Shrimp Burro and Baja Sur Dogfish Shark Taco.  They are both were very delicious meals but the shrimp burro stole the show.  So much flavor.  I snagged some bites from my hubbys mole and mahi mahi burros- mmmm such a delight.  The salsa bar is endless.  I really stocked up.  I was excited to try the strawberry salsa but it was too hot, in fact it all was, but I'm a big wimp when it comes to hot peppers. The horchata is handmade and delicious.  They throw pecans and some fruit in there too which is a yummy bonus!\n\nAs if the good food wasn't enough to win me over the art in this restaurant sho did!  I'm a sucker for Mexican folk art and Frida Kahlo is my Oprah.  There's a painting of her and Diego hanging over the salsa bar, it's amazing.  All the paintings are great, love the artist.", "type": "review", "business_id": "zp713qNhx8d9KCJJnrw1xA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "1ieuYcKS7zeAv_U15AB13A", "review_id": "JL7GXJ9u4YMx7Rzs05NfiQ", "stars": 4, "date": "2012-07-12", "text": "Luckily, I didn't have to travel far to make my connecting flight. And for this, I thank you, Phoenix.\n\nMy brief layover was pleasant as the employees were kind and the flight was on time.  Hopefully, next time I can grace Phoenix with my presence for a little while longer.", "type": "review", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Vh_DlizgGhSqQh4qfZ2h6A", "review_id": "XtnfnYmnJYi71yIuGsXIUA", "stars": 4, "date": "2012-08-17", "text": "Definitely come for Happy hour! Prices are amazing, sake bombers for $3...Great atmosphere and wait staff was incredibly nice and right on to all of our needs, didn't have to ask for a thing They were always spot on...Place gets crowded in the evening especially if you plan on sitting outside. I only wish there were one in Apollo Beach or Brandon!", "type": "review", "business_id": "wNUea3IXZWD63bbOQaOH-g"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "sUNkXg8-KFtCMQDV6zRzQg", "review_id": "jJAIXA46pU1swYyRCdfXtQ", "stars": 5, "date": "2010-08-11", "text": "Nobuo shows his unique talents with everything on the menu. Carefully crafted features with much to drink. Start with the pork belly buns and a stout. Then go on until you can no longer.", "type": "review", "business_id": "nMHhuYan8e3cONo3PornJA"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "-OMlS6yWkYjVldNhC31wYg", "review_id": "E11jzpKz9Kw5K7fuARWfRw", "stars": 5, "date": "2010-06-16", "text": "The oldish man who owns the store is as sweet as can be.  Perhaps sweeter than the cookies or ice cream.\n\nHere's the lowdown: Giant ice cream cookie sandwiches for super cheap.  The flavor permutations are basically endless.  I had snickerdoodle with cookies and cream ice cream.  It was marvelous.", "type": "review", "business_id": "AsSCv0q_BWqIe3mX2JqsOQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "C1rHp3dmepNea7XiouwB6Q", "review_id": "3rPt0LxF7rgmEUrznoH22w", "stars": 5, "date": "2011-10-21", "text": "Wonderful Vietnamese sandwich shoppe. Their baguettes are great hot out of the oven with butter or in one of their many sandwich choices. They have a modest selection of baked goods along with some of the best egg rolls around. Bring cash or your ATM card as no credit cards are accepted but they have an ATM on premises.", "type": "review", "business_id": "e9nN4XxjdHj4qtKCOPq_vg"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "UPtysDF6cUDUxq2KY-6Dcg", "review_id": "cGnKNX3I9rthE0-TH24-qA", "stars": 5, "date": "2010-01-11", "text": "They have a limited time thing going on right now with BBQ chicken pizza (not sure how long it's going to last) but let me just say it was amazing.  Probably THE best BBQ Chicken pizza I have ever had.  I have tried other things too, like the tomato basil soup, and many of their sandwiches ... very good, very fresh - every time.  \n\nThe 5 stars is for the pizza, but if I were to rate Jason's Deli over all they would get about a 4.", "type": "review", "business_id": "h53YuCiIDfEFSJCQpk8v1g"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "Xm8HXE1JHqscXe5BKf0GFQ", "review_id": "FvEEw1_OsrYdvwLV5Hrliw", "stars": 4, "date": "2011-12-23", "text": "Good tattoo shop. Clean space, multiple artists to choose from and books of their work are available for you to look though and decide who's style most mirrors what you're looking for. I chose Jet to do a cover-up for me and he worked with me on the design and our ideas and communication flowed very well. He's a very personable guy, is friendly and keeps the conversation going while he's working on you, and he doesn't dick around (read: He starts to work and continues until the job is done). He's very professional and informative. Good customer service combines with talent at the craft.", "type": "review", "business_id": "WGNIYMeXPyoWav1APUq7jA"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "JOG-4G4e8ae3lx_szHtR8g", "review_id": "pfUwBKYYmUXeiwrhDluQcw", "stars": 4, "date": "2010-05-20", "text": "I'm 2 weeks new to Phoenix. I looked up Irish bars in town and found Rosie's. The decor and ambience was outstanding. I went there by myself on a Wednesday night in hopes of finding some friendly folks and that is exactly what happened. I ate dinner at the bar. Marcy was the bartender and she was very friendly and helpful and she introduced me to a whole bunch of people. For dinner I had a Rueben sandwich, which was pretty large and very good. I had a a small Rosie salad as my side and it did the job. I wish it was made with lettuce other than iceburg, but the bacon & eggs & other toppings helped a whole lot. I drank a nice, cold Smithwick's from the tap. Followed that up with 2 vodka tonics and my whole tab was under $25! \n\nThe basketball game was on when I first got there. After the game, the jukebox was playing a fabulous mix of the best oldies. Around 10pm a live band played. I didn't catch much of their performance but I did notice that I really like the singer's voice and that's rare for me since I don't typically care for female vocalists.\n\n\nAll the people I spoke to were super nice and very welcoming. I am sure I will see a bunch (or all) of them again and I look forward to that!", "type": "review", "business_id": "yc5AH9H71xJidA_J2mChLA"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "ylWOj2y7TV2e3yYeWhu2QA", "review_id": "HvqmdqWcerVWO3Gs6zbrOw", "stars": 2, "date": "2011-03-20", "text": "Was it worth the 21$ for a salad and small pizza? Absolutely not! Bad service. Maybe the guys grandma died I don't know. I want to tell you what really made me mad about the experience. We order the small pizza and salad and the guys could have cared less and took our $ and we sat down. We were looking around and hmm, there's a sign saying \"x large pizza and large salad only 23$\". Wow that would have been nice if the guy told us that. I left hungry, mad and unsatisfied. \n\nTo the owner: teach your employees the value of upselling and telling the specials. Something so small can affect a customers experience negatively. \n\nAnd your salads are severely overpriced \n\nWon't go back unless I'm desperate.", "type": "review", "business_id": "Vb9FPCEL6Ly24PNxLBaAFw"}
{"votes": {"funny": 2, "useful": 4, "cool": 3}, "user_id": "SBbftLzfYYKItOMFwOTIJg", "review_id": "HXP_0Ul-FCmA4f-k9CqvaQ", "stars": 3, "date": "2008-10-12", "text": "We went here on a Saturday afternoon and this place was incredibly empty.  They had brunch specials going on, including $2 bloody mary's and mimosas, but we were more in the mood for lunch.  Except for the bloody mary, I had to try one.  It came out in a high-ball-sized glass.  Boo!  But it was really tasty. Yay!  The hubby remembered a sign outside the restaurant a few weeks back that said they had Arrogant Bastard, and he got a 22 oz bottle for $4.75.  Hey, that's not fair!!\n\nNext up: the wings.  We were a bit hesitant to order them when the waitress informed us that they are \"seasoned\" but not sauced, so they can't be ordered hot.  We did ask for them crispy though, and the waitress even asked the cooks to throw them back in for a few minutes when they came out not visibly crispy.  These non-traditional wings were actually pretty damn good.  The seasoning was a little spicy and salty with just a hint of sweet.  If I were in the mood for the tang and kick of Frank's Hot Sauce, these wouldn't cut it, but otherwise they were good enough to go back again for.\n\nMy entree was the Tilapia salad, and I was a bit disappointed.  The fish was a bit dry and uninspired. And the greens underneath were overdressed and wilted.  I ate the greens around the fish and picked out the almonds and Mandarin oranges, but I had to leave the mush hiding underneath the fish.\n\nIt wasn't bad enough to say I wouldn't go back, but I won't be anxiously awaiting my next trip.", "type": "review", "business_id": "supigcPNO9IKo6olaTNV-g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "u1KWcbPMvXFEEYkZZ0Yktg", "review_id": "j4SIzrIy0WrmW4yr4--Khg", "stars": 5, "date": "2010-05-03", "text": "okay this is the best place EVER! i grew up shopping at the one in los gatos, and the one in Oakville. i was shock when i saw the best store in the world in Scottsdale and then not surprised at all. the have all the good stuff. from cheese down to wine. i can't tell you how happy i am that this store is here in Arizona. now if we could just get dean and deluca!", "type": "review", "business_id": "O510Re68mOy9dU490JTKCg"}
{"votes": {"funny": 4, "useful": 6, "cool": 5}, "user_id": "UsULgP4bKA8RMzs8dQzcsA", "review_id": "v0cTd3PNpYCkTyGKSpOfGA", "stars": 3, "date": "2009-03-06", "text": "I met a friend for lunch yesterday. \n\nLoved the water feature and patio walking in, if it had been warmer I would have definitely sat outside. \n\nInside was a little dark and I guess it was all the bats around but it reminded me of \"Dusk Till Dawn\". \n\nWe were seated, I hope was hoping for chips and salsa, I guess they don't serve them here? \nWe weren't even offered the ones on the menu, which I probably would have declined anyway because chips and salsa should be complimentary. \n\nAnyhow I ordered the Fresh Snapper Tacos (see pics) \nThere is a lot of fish there being smothered by all those peppers, but as for everything else what you see is what you get.\n\nFor $15 I would have liked more than a TBSP of each, rice and beans, and a DEFINITELY more than a teaspoon of cheese and sour cream and maybe a lime or lemon. \nThere was more garnish on the plate than anything. Other than that it was good. \n\nMy Friend ordered the Green Chile Stew and The Green Chile Mac and Cheese (see pics) She has been here before so knew what she liked. I tasted the macaroni and thought it was pretty good too.\n\nI'll give 3 stars until I go back and try out some other things.", "type": "review", "business_id": "b5cEoKR8iQliq-yT2_O0LQ"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "nDBly08j5URmrHQ2JCbyiw", "review_id": "a0lCu-j2Sk_kHQsZi_eNgw", "stars": 4, "date": "2011-11-17", "text": "They've gotten better and better for me in the time since this review was written. \n\nMy last contact with them was a few days ago when I was having trouble redeeming some Groupons on their website. I called customer service and after waiting a few minutes I spoke with a rep who cheerfully booked four separate flights for me, patiently and manually entering my Groupon info for each one.\n\nI think the acquisition by Republic has helped them overall. After Republic took over the in-flight cookies started. It still tends to suck if you aren't Ascent club (like just about any budget-centric airline does), but once you get there it's a good value. When I've had to fly Southwest or USAir I've been disappointed in comparison.", "type": "review", "business_id": "4JzzbSbK9wmlOBJZWYfuCg"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "C6IOtaaYdLIT5fWd7ZYIuA", "review_id": "MuqugTuR5DdIPcZ2IVP3aQ", "stars": 3, "date": "2008-10-08", "text": "DVAP....\n\nYou have to go at least once in your life. It really is a neat place with alot of history. \n\nThe service is great, it appears to be family run. \n\nThe food is good. Better then Dennys but not as good as Mimi's. \n\nI had the all u can eat of beef ribs, lasagna, meat loaf, cat fish, chicken, mashed and diced potatoes, stuffing, rice, homemade apple pie, etc and salad bar. I know I am missing a bunch of stuff they had but you get the drift. \n\nThey run specials on Prime rib and stuff so you might want to call to see what they are serving the night you go.", "type": "review", "business_id": "8FNO4D3eozpIjj0k3q5Zbg"}
{"votes": {"funny": 2, "useful": 1, "cool": 1}, "user_id": "YN3ZLOdg8kpnfbVcIhuEZA", "review_id": "LmuKVFh03Uz318VKnUWrxA", "stars": 5, "date": "2011-06-28", "text": "This place shouldn't even be reviewed - because it is the kind of place I want to keep for myself...  =)", "type": "review", "business_id": "tdcjXyFLMKAsvRhURNOkCg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "6lg55RIP23VhjYEBXJ8Njw", "review_id": "CQYc8hgKxV4enApDkx0IhA", "stars": 5, "date": "2011-07-13", "text": "first time my friend and I went there... it was delicious!  The food, garlic knots our favorite and of course the wine!  We will be going back ALOT!", "type": "review", "business_id": "eFA9dqXT5EA_TrMgbo03QQ"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "zRlQEDYd_HKp0VS3hnAffA", "review_id": "Dx9sfFU6Zn0GYOckijom-g", "stars": 1, "date": "2010-09-05", "text": "U can go there n check the car out. If u wanna buy 1 there? That's wrong move! If u even want a car service from there? U made a biggest mistake of ur life!! I had 1 time asked my girlfriend to take my car there for an oil service, guess what? They ripped my girlfriend off by lying how bad my car is now. If without fixing the problem. Might bring some serious accident. Then she did what they said. 4 brand new tires, timing belt, 4 new brake pads. U know why's the worst? All of those above I had just changed 2 months before!!! What a trashy dealer is that? People, better off go somewhere!", "type": "review", "business_id": "IJ0o6b8bJFAbG6MjGfBebQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "13xj6FSvYO0rZVRv5XZp4w", "review_id": "cFtQnKzn2VDpBedy_TxlvA", "stars": 5, "date": "2011-05-22", "text": "I love this place! I have been coming here for ages.\nMy favorites: Elsa's Chicken sandwich, any of their burgers, dragon chicken wings, china's little chicken sandwich, and the hot pepper chicken sandwich. The atmosphere is always fun and the art they display is very abstract but totally cool!", "type": "review", "business_id": "JhupPnWfNlMJivnWB5druA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "rLtl8ZkDX5vH5nAx9C3q5Q", "review_id": "ChBeixVZerfFkeO0McdlbA", "stars": 4, "date": "2010-05-26", "text": "This place is great.  A nice little ole' fashion homemade ice cream place that looks like it has been there for forever.  The place has a real nice vibe to it.  Sorta reminds me of Sugar Bowl only smaller, not as busy, and easier parking.\n\nThe menu is ginormous.  I couldn't decide what to get but that didn't matter because the other 3 people I went with chose for me.  I wanted something basic but they insisted on sharing the 'patte' thing.  It is a few scoops of ice cream over a brownie and topped with whip cream and caramel.  While it was very good it just wasn't what I wanted.  Next time I'm just going to get a scoop or 2 of the ice cream so I can really taste what the ice cream is all about.  It is just too difficult to tell when it is topped with a bunch of stuff.  The ice cream we got on the brownie though (butter brittle I think) was excellent.  They have tons of different flavors and they all sound delish!\n\nAnyway I can't wait to go back if I am ever in the area again and need a sugar rush!", "type": "review", "business_id": "wzP2yNpV5p04nh0injjymA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "fpItLlgimq0nRltWOkuJJw", "review_id": "kZ4TzrVX6qeF0OvrVTGVEw", "stars": 5, "date": "2013-01-03", "text": "I love love LOVE this place. My boss (who is into healthy eating) recommended this place. I went over with some highly skeptical friends and one dinner was enough to convert them into believers! The food here is so good! We had the Shrimp dumplings and the Onion tart as starters. We ordered the Shirataki noodles and street tacos as entrees. So also ordered the Kale-aid. All of the dishes were yummy. \nI have gone back many times since then and have never been disappointed! I have gone after yoga to get some Kale salad or the chicken chopped salad. I always have to get the Kale aid. \nOnce, a guy at the next table, uprooted a whole plant by mistake (on the patio) and was highly embarrassed as was his date! Ever since, I have very careful not to throw my arms around as I can be quite clumsy sometimes! I do NOT want to be banned from my favorite place for my clumsiness! I don't think I can live without True Food!", "type": "review", "business_id": "qjmCVYkwP-HDa35jwYucbQ"}
{"votes": {"funny": 1, "useful": 4, "cool": 2}, "user_id": "RRTraCQw77EU4yZh0BBTag", "review_id": "B5h25WK28rJjx4KHm4gr7g", "stars": 4, "date": "2008-03-21", "text": "Not that my review will mean much given the more in-depth reviewers but I will chime in nonetheless...\n\nI can really only review one dish, the #3 lunch special, Yellow Curry Chicken. I don't know what the authentic name for it is, Kang Karee something or other. It's so tasty that the first time I had it I knew I'd never branch out. Good lunch spot if you work around downtown. Not the quickest service all the time and can get busy during lunch, but always consistently good. Fairly dim inside, a good place to forget about the sun on a summer day.", "type": "review", "business_id": "wct7rZKyZqZftzmAU-vhWQ"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "EP3cGJvYiuOwumerwADplg", "review_id": "Y_ERKao0J5WsRiCtlKSNSA", "stars": 4, "date": "2011-03-30", "text": "Came here for breakfast yesterday, it had been years since I have stopped in here and do not remember the entire place having waiter service.  Place was empty at 9am on a Tuesday morning but the atmosphere was casual, this place is pretty much been here for as long as I can remember and I am one of the 2 people that are native to Phoenix.  I always felt it was pricey but I think inflation has caught up since prices seemed normal when I went yesterday.  I loved the chips and salsa, the hot sauce is fantastic with a great spicy kick.  I went with the recommendation of the chile relleno which isn't my favorite but I like going with what waiters say so I gave it a try.  It was great!  Very flavorful and they just put it on the eggs so you can eat it together, the tortillas are fresh and home-made tasting, the hash browns and beans were good too.  I read my newspaper and drank my soda while I enjoyed the whole place to myself....oh yeah, I read some Yelp reviews and bookmarked my next stop too, ha ha.", "type": "review", "business_id": "vz2zQQSjy-NnnKLZzjjoxA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "kpbhy1zPewGDmdNfNqQp-g", "review_id": "hre97jjSwon4bn1muHKOJg", "stars": 4, "date": "2012-07-12", "text": "Always reliably good.  Great beer selection as well as fabulous \"bitch fizz\" (ciders, etc.) and cocktails.  Their pizza is outstanding AND they have a healthy menu.  I generally steer clear of chains but this is an exception.", "type": "review", "business_id": "i213sY5rhkfCO8cD-FPr1A"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "bCKjygWJZOQHCOzootbvow", "review_id": "dtpJXC5p_sdWDLSobluJ3Q", "stars": 5, "date": "2011-05-09", "text": "Disclaimer: Like many of you, I am a sucker for charming little homes that have been re-purposed into restaurants. I am certain that this colored my opinion of Cibo.\n\nThat being said, I absolutely love having lunch here the other day. I unknowingly arrived at 2:05 (5 minutes after they close between lunch and dinner) but was served anyway. I had the salscicia sandwich and a side of fruit. The sandwich was excellent, served on perfectly crisp, chewy saltimbocca bread. The sausage was flavorful and was complimented by roasted red peppers and onions. All this was finished off with a great quality mozzarella cheese. Really, really delicious.\n\nI should also say that the atmosphere here was friendly and  comfortable, though a bit small. This would be a great place to hang out if you lived nearby.", "type": "review", "business_id": "V1nEpIRmEa1768oj_tuxeQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "8AMn6644NmBf96xGO3w6OA", "review_id": "S9OVpXat8k5YwWCn6FAgXg", "stars": 1, "date": "2012-05-04", "text": "Disgusting!  Had a Groupon so my daughter and I tried it out.  Very outdated and gaudy 80's style interior made me feel like I was in an episode of Sopranos.  The food itself was pretty bad.  We ordered pretty simple dishes but they just had no flavor at all!  After trying it out I'm positive all the good reviews on here are employees or owners creating them.", "type": "review", "business_id": "vvA3fbps4F9nGlAEYKk_sA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "HLbhD2OyiMCUDRR4c1iXaw", "review_id": "-v-shjbxoj7hpU62yn6vag", "stars": 5, "date": "2012-09-09", "text": "Never having dealt with a Discount Tire in Phoenix before (only in Texas, and their service has been great all the time), I came in not knowing what kind of service to expect. I was pleasantly surprised! The store had a good amount of parking, and the store front was clean, open and had adequate seating around the perimeters. There were already 5-6 people sitting and waiting for their cars to be finished, and 2 people waiting infront of me to see a representative. All the guys working there were busy helping someone, yet were saying hello to us and reassuring they'd get to us very soon. I didn't wait an unneccesary amount of time and then was helped by Wally. He inspected my tires, recommended a plan of action gave me options, and we headed back into the store. After I made my decision to replace 2 of the tires, he checked their stock, and unfortunately they didn't have them there. BUT he called another store and had them picked up for the next morning, so I could just come back the next day to this same store and get those bad boys installed. Great! The prices were not as heafty (relief), and although there were a good amount of people the next day waiting for their cars to also be serviced, it took exactly the amount of time they'd told me (45 min). They apologized for the wait, but no need for that! The guy who helped me on the 2nd day (I'm sorry I forgot his name) was also very professional and great. I recommend this store and will be bringing my car here in the future most definitely. Thanks, guys!\n\nTIP: If you know you need to bring your car in, you can make an appointment with them online. They take walk-ins, but I believe it helps them manage their customers easier, and that in turn benefits you.", "type": "review", "business_id": "rxQ2PIjhAx6dgAqUalf99Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "3iuZFgxUFKLxOplkDrFmyg", "review_id": "2VTwjhOX3UUvgOGbxe4xfA", "stars": 4, "date": "2010-03-28", "text": "I went here again when I got back to Phoenix after being gone for six months. This is one of my mom's favorite places to eat and I can understand why. The ravioli and the miso soup are so delicious! The wine was ok and I would recommend one of their elixirs over an alcohol beverage. Still a pretty delicious place to go in Phoenix.", "type": "review", "business_id": "qjmCVYkwP-HDa35jwYucbQ"}
{"votes": {"funny": 1, "useful": 3, "cool": 1}, "user_id": "1guJDgUfTiDdbgKqBhsZFQ", "review_id": "Bk7F8IyBuOHVp6w3BAKVow", "stars": 3, "date": "2011-03-27", "text": "There's two ways to look at this place. One is getting quality food at a good price. The other is getting a lot of food for a cheap price. I prefer the former but those who prefer the latter won't agree with my review.\n\nI thought the scramble I had was okay but nothing fantastic. I definitely didn't care for the biscuits. The food wasn't health conscious at all but if you're looking to fill up with calories and get a good-sized portion then this is your type of place. Also, I am not a fan of the diner-type ambiance... I would rather have something with more character but I'm glad I tried this place out.", "type": "review", "business_id": "3oLy0rlzRI_xiqfQHqC4_g"}
{"votes": {"funny": 3, "useful": 4, "cool": 0}, "user_id": "iwUN95LIaEr75TZE_JC6bg", "review_id": "ApKbwpYJdnhhgP4NbjQw2Q", "stars": 1, "date": "2011-11-30", "text": "I've eaten here many times, but none as bad as last night.\nService was excellent, and highly attentive.\nFood, absolutely horrible.\n\nMy expectation was they would serve a steak on par with their seafood. After all, they were charging 39 bucks for a ribeye. \nWhat I was hoping for was a 1- 1-1/2' thick steak, cooked Pittsburgh style as I had ordered. \nWhat I got a a 3/4 in thick piece of meat that was mostly fat, gristle, and in no way resembled Pittsburgh Style. \nSalad, similar to something you could get at Chick Filet\nVeggies, blah.\nBread basket, ample, but day old, and if not, it certainly wasn't fresh. \n\nIn addition to bad food, we were crammed into a small room where we were nuts to butts with 6 other tables, listening to conversations ranging from someone's recent bout with pinkeye, and another couple who elected to speak entirely in French, until the waiter showed up, then it was like they turned off the French switch and suddenly began speaking English. \n\nI've had it with this place.\nIf I'm going to pay 150 bucks for dinner, it'll be at Mortons, or Maestro where the steaks are 1-1/2 in thick, cooked to perfection, and half of it doesnt wind up on the plate as fat and gristle", "type": "review", "business_id": "o1GIYYZJjM6nM03fQs_uEQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "iFa0SLpNeLbx6aux65mNbQ", "review_id": "vUuFuf4LYxfqbZH3lYxJfw", "stars": 4, "date": "2008-12-28", "text": "They must have renovated this place in the last year. It is now spacious and airy and there is no longer the dreaded \"hover over a table to get a seat\" necessity.  It now reminds me much more of the dreaded \"Panera Bread\" chain in California, but the food is still much better and has much less of a \"mass produced\" feeling and taste.\n\nThe service (management, staff etc) were extremely attentive and responsive to requests as well as keeping the place extremely well clean and cleared.\n\nI love carbs...Carbs with carbs and a side of carbs.  They serve warm syrup with their pancakes (yum!) and their bread is just amazing.  \n\nThe \"side of pancakes\" is plenty big for a meal and they are always consistent, fluffy, and tasty.  \n\nThey offer both a dark roast and a house roast for coffee and all the powdery loveliness (cinnamon, nutmeg, cocoa) to top it off just right.\n\nToday, before returning to the land of freeways and smog and eternal sunshine(well, the other land of that anyway) we enjoyed their peppermint hot chocolate. I would highly recommend that you run on it and have this frothy goodness before the holiday season ends!", "type": "review", "business_id": "Pr9rQKypHgC_J1AfufxzIw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "370JyOQfFcPSB9_jk641gA", "review_id": "gNm48xplqt42p-NvCkzUBg", "stars": 4, "date": "2012-10-16", "text": "Very clean and well thought out floor plans, nice to have a friendly staff with smiling faces. Best Target I have been to in a while.", "type": "review", "business_id": "AGar9KVq_W7YcF76avbDTw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Ja8SAyDdf1aY-E7vVixJiw", "review_id": "5V9lfjjlY7tkXgkcDUWYyg", "stars": 4, "date": "2011-01-02", "text": "This Mexican food is very simple, slightly bland, but fairly fresh. The chicken is chopped up into tofu-looking squares. But I was satisfied with the food, which was fairly healthy Mexican food as Mexican food goes. The staff is quite polite. I met some cool people hanging out there while I sat outside.", "type": "review", "business_id": "-kVXDEqGHOWKxQ3EhvFgVA"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "N3L6SDymSRkYQtTiSDmXSg", "review_id": "1fRGR6XTTElRBZW_oDrpUA", "stars": 4, "date": "2008-07-09", "text": "Decor  functional \nStaff friendly and are really kind to our toddler\nfood rocks  within my  limited range of  red and yellow curries ( so much so they suggested I try something else, hey it's not my fault these are so good that I didn't want to risk anything lesser. \n\nPrices are a bargain for entrees,  spice is there, they really get the request to make it very very hot.   This is probably the best bargain  in North Phoenix for  spice hounds", "type": "review", "business_id": "qyNtVViurIcChc35mfYIEw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "F0dO68TECqEJBhBJ4P0qVA", "review_id": "2sG6LKzRz91l10stVHl8uQ", "stars": 4, "date": "2011-11-09", "text": "This Place just opened up next to the salon I work in. AMAZING! They hit the ground running, \n\nIt's a deli style, where you order at the counter and they bring you the food. I had the Grayhawk Turkey Club and the turkey was great! No packaged crap here. It was thick sliced and probably rotisserie. For the side I had sweet potato tater tots. DELISH! The have regular fries, sweet fries, tater tots, onion rings, etc. \n\nGreat looking salads, Chicago-style dogs, gourmet burgers and yummy sounding mac and cheese. \n\nThe only thing keeping it from 5 stars is the price. It's great for dinner, but a little steep for a work day lunch.", "type": "review", "business_id": "umdxfhSlk67yGEi8-S-bEg"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "W_QXYA7A0IhMrvbckz7eVg", "review_id": "fuY6Bf4EtW3UwrdLQJa9_Q", "stars": 4, "date": "2009-03-13", "text": "I really really like Frances.  I love most of the clothes in there, but I can never have them because I can't afford it.  The store in general is pretty cool, there are lots of neat things in here from stationery to clothes to jewelry to baby stuff to dog stuff to vintage stuff.  There is a lot of stuff here.  It's all quite pricey though.  The sales they have every now and then are sorta okay, but still break the bank if you buy anything.  Overall they carry good quality products and the staff is super friendly and helpful.  I can't hate on a place too bad just because I can't afford it.", "type": "review", "business_id": "qsThMZ3lXWYLN4t08ScsNA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "PiDqfET_ZrDKJSLKe03O9A", "review_id": "UTWI0z7nV5zNJLWnOz9Z5A", "stars": 4, "date": "2012-06-30", "text": "Solid food, great device, and casual environment.  They will not leave you hungry.  Overall, it's really good.", "type": "review", "business_id": "puy0PzIcCgR3KWJI7llBFQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "wv5-4IPtpVA8wdqXu-Onpw", "review_id": "7uzj6rJ71toRmdsXyo2suA", "stars": 4, "date": "2012-04-12", "text": "my son really enjoys islands, great food, casual kid freindly atmoshpere we go here quite a lot and seem to keep coming back", "type": "review", "business_id": "e0vubCKi8KD8zC2C6FdbuQ"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "7cR92zkDv4W3kqzii6axvg", "review_id": "HXU9dbOSlByXW-dB8LmJgA", "stars": 4, "date": "2009-06-13", "text": "I was seated at the bar. A very nice young man was working the bar an provided good conversation.\n\nI was offered a DELICIOUS chicken, bacon, bleu cheese amuse. Yum!\n\nI ordered a pine nut pesto pizza, which wad delivered by the chef! :)\n\nThe crust was perfect! Thick enough for structure and substance, but thin enough to \"hide\" behind the flavors of tomato and pine nut pesto.\nThe cheese was also just right.\n\nDelicious!\n\nI also had the chicken panini, which was fantastic! The bread was a bit hard, but I think I was too busy talking and let it sit too long.\n\nAll in all I'd definitely recommend L'Academie if you're in that area of Scottsdale.", "type": "review", "business_id": "faSdsW2s_SaVN0KTy-R2MQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "66PQJEHC0tCWGMI4V9KT-Q", "review_id": "1FvrC35rTJ6BWFvRog7tuA", "stars": 3, "date": "2011-12-21", "text": "Everything was nice. The ice cream was delicious, no overwhelming alcohol taste & an interesting variety of flavors. Service was fine, place was clean. I'll go back, but only because I have a killer sweet tooth and they're in the neighborhood.", "type": "review", "business_id": "qB-qsaSnhbHCt18_AN4Quw"}
{"votes": {"funny": 1, "useful": 1, "cool": 2}, "user_id": "IUWjTmXc3wLVaMHz33inaA", "review_id": "Ckk1Cne1GHwzmJfo7M4r2w", "stars": 5, "date": "2009-04-04", "text": "(Un)fortunately for me, lux is close to my house.  I walk there nearly every day and am much poorer because of it.  The coffee and pastries are amazing.  They always play really great music too!", "type": "review", "business_id": "aRkYtXfmEKYG-eTDf_qUsw"}
{"votes": {"funny": 1, "useful": 1, "cool": 0}, "user_id": "1MyXsAhZK35A6EAr4reLCA", "review_id": "bu9S6tFKuTrMcNxQaQYMQA", "stars": 3, "date": "2010-09-25", "text": "After watching her win on Cupcake Wars I was determined to find this place (It's very well hidden)and sample the cupcakes.  I have to say I was not impressed; i make better cupcakes on my own.  More creative and not so sweet you'll go into a diabetic coma.  i did have a California BLT as well and it was a good sandwich although the bread was a little too toasted for my liking.  The staff was friendly, the ambiance was very pleasant and it was clean.  But the cupcakes...really not all that.  Sorry....", "type": "review", "business_id": "JuBygU4XDjqSeW9okyvbsQ"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "r-t7IiTSD0QZdt8lOUCqeQ", "review_id": "V75NCU3EhqTDwPj5In94DQ", "stars": 4, "date": "2012-01-03", "text": "Good for an easy and leisurely business lunch or outing with the girls.  The market downstairs is great for takeout and a great selection of bakery treats.", "type": "review", "business_id": "jRfdz5voj40P6WS9L54caw"}
{"votes": {"funny": 1, "useful": 2, "cool": 1}, "user_id": "J3I2NClEbD1Xr8lOdjxlqQ", "review_id": "GxaYFCprt-wyqO--vB4PHQ", "stars": 4, "date": "2011-10-03", "text": "After my last review, somewhat scathing regarding the burgers, I got an invite from the management to come down, meet the chef and give him another try.  I thought to myself, \"how nice\", they read my review and they are concerned about the quality of their product.  I think that is admirable.  I did not take them up on the offer, because I don't feel that would be appropriate - I'm interested in doing yelp reviews because I have benefitted from reading the reviews of others, and I want to share my thoughts and feelings too :-) - I'm not looking for freebies.\n\nSo, anyway, last friday seemed like a good day to walk over to LGO and see what's shakin.  I grabbed my growler jug (still the best deal around) and the wife, called a friend to join us for a beer and walked on down to the corner.  The evening was a bit on the warm side, but it was quiet and about the normal buzz of busyness for this corner.  It's always kinda crazy and we like to sit on the patio to watch the manic drivers race around trying to find parking.  We went into the store and the wife ordered a grilled-fish sandwich.  I nervously ordered a cheeseburger with fries.  After placing our orders and getting warned that we needed to be around to pick them up, I moseyed over to the bar to get my jug filled with Stella.  Did I mention that this is an awesome deal?  So, we got some glasses and headed out to the patio.  Soon afterward, they called our name and we got our grub.  My wife's fish sandwich was consumed with muffled oooh's and ahhhhs', and she raved about the perfect texture, grilled flavor and delicious, fresh multi-grain bread.  She also raved about the slaw that came with it.  I think she liked this sandwich.  The burger, on the other hand, is still a disappointment.  I ordered it Medium Rare (the only way to order a burger) and kudos to the woman for not warning me about undercooked meats - I'm aware.  really. And I asked for cheese and put it on a hamburger bun.  It came open-faced with a pile of coarsly shredded mild cheddar cheese.  It had the appropriate veggies - lettuce, pickle and tomato, red onion slices and the special sauce.  With a pile of limp matchstick fries on the side, it was a big pile-o-food.  The portion was impressive.  That's about where it ended for me.  The burger was overcooked and the pile of shredded cheese is a bit off-putting.  It's impressive, I'll give 'em that, but a big pile of cold, shredded cheese just doesn't work for me.  The cheese needs to be melted.  A good burger has the cheese melted.  at least some.  Lot's of cheese can be fun, but it overpowers the rest of the flavors and tends to cool the burger quickly.  I scraped off about two-thirds of the cheese - enough to make a cheese crisp if I had a tortilla, and put the burger together.  Flavor was so-so.  After I added some salt and pepper, flavor was just a little better than so-so.  Burger was cooked to med-well, but still juicy.  The veggies were fresh and crispy.  A side of mayo for dipping the fries in is required for me.  I like my fries Belgian style.  The bun was a little dry and on the edge of stale, but not bad enough that I could not eat it still.  Overall, I stand by my original review of the burgers here.  I realize LGO is trying to stand out with a \"different\" presentation, and I applaud the effort, but I think it needs a bit more work to stand out at a time when everybody is doing burgers.  The fries were sub-par, limp and forgettable.  The ambiance, however, is what brings us back.  Sitting on the corner patio, sipping a beer, having a great conversation and watching the show all around me is a great way to wind down on a warm Friday night.  LGO - keep working on the burger, I'll keep coming in, but I think I'll stick with the wings for now.", "type": "review", "business_id": "7SO_rX1F6rQEl-5s3wZxgQ"}
{"votes": {"funny": 1, "useful": 0, "cool": 1}, "user_id": "jdoGEEy5s-5L1O_lNzEi2g", "review_id": "RZZ9Tf5GWYwrcjg-ACiKmQ", "stars": 4, "date": "2010-08-04", "text": "Cliff notes\n- Cheap: $1-2/plate\n- Fast: It's ready-to-go and on a conveyor\n- Acceptable quality: I'm here weekly and haven't gotten sick lol\n\nThis place is definitely good for what it is, \"it\" being a budget-friendly sushi place that's great for a quick bite.  In a response to the lower-rating reviews stating how the food is just okay at best or authentic or blah blah blah, well think of it like wal-mart vs. *inserthighendretailerhere*.  This place has a business model based on selling in large volumes (hence the low prices like wal-mart) so they're gonna have to \"reduce costs\" somehow (so-so quality food, not-so-attentive staff, and slightly smaller than average portions), but it's still a solid bang-for-your-buck kinda place.\n\nOn top of this, I can be in and out quickly since everything is already prepared, perfect for those quick 30 min lunch breaks.  All that's required is for you to grab it off the conveyor (depending on whether or not all the items you want are on the conveyor at the time). \n\nI've never had issues with seating, but do not make a point to go during peak hours and usually go with a small party (2-4 people).\n\nFor those claiming to be \"left to fend for themselves\" due to an inattentive staff, most of your sushi-related inquiries can be answered by this thing called \"the menu\" that sits on the counters.  See, this miraculous piece of technology contains things referred to as \"descriptions\" on them that help to inform you about the sushi going round-and-round before you.  Furthermore, there's even a pricing guide based on the color code of the plates to assist you further! WOW! Lol wtf do people expect for $1-2 plates of sushi?  Someone to hold your hand? LOLOLOLOLOLOLOL DIAF\n\nAnd the cherry on top? $4 large japanese beers and $5 sake bombs! HELL YEAH!", "type": "review", "business_id": "EC9WB-iVjd28B6R6KIZ8TA"}
{"votes": {"funny": 1, "useful": 2, "cool": 3}, "user_id": "aqqbh1NZoFk48kp0eqSLdg", "review_id": "Bmt1QRDT0GfyXkhOvj_BfQ", "stars": 5, "date": "2010-02-01", "text": "Fred M. pretty much said what I would say, so I won't beat a dead horse.  I'll add, though, that they offer a wide variety of deep-fried quesadillas.  \n\nDid you catch that?\n\nDEEP FRIED QUESADILLAS!", "type": "review", "business_id": "zp713qNhx8d9KCJJnrw1xA"}
{"votes": {"funny": 0, "useful": 2, "cool": 1}, "user_id": "ynGxw3zZqAjahVou563zXQ", "review_id": "V4hBluqV-xbgzk7Y6y9kzw", "stars": 4, "date": "2007-10-29", "text": "I have no idea whether there is a Japanese community in this part of town, but New Tokyo would suit one well.  It's rather small, but they have a wide selection of Japanese, snacks, beverages (including my new fave beer, Asahi Black), refrigerated items, staples, etc.  \n\nThis is not an Asian market, it's specifically Japanese, so don't expect more than a few crossover items like kimchi.  That being said, sometimes it's good to specialize.  It lets them carry more variety of Japanese products.\n\nThe cashier was very friendly when I finally stopped loading my basket long enough to check out.  Like the first reviewer, I loaded up with snacks for the hotel room...along with a six-pack of Asahi Black, of course.  Oh, one more important factor...the prices were quite reasonable, in line with most ethnic market imports...maybe even a bit cheaper than usual.", "type": "review", "business_id": "pWPzxPPXN4IqI7RUU_8KKw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Mb0psF4WQF7gZSuZafVr-g", "review_id": "hHwQaL3QN2xgTBSCQ26wIA", "stars": 4, "date": "2011-12-13", "text": "We got passes for the preview of Mission Impossible (Ghost Protocol).  We enjoyed the movie a lot.  The theater itself is fine.  The chairs don't move, and you can't raise the arm rests.  No rocking, no reclining (granted most theater seats don't move a lot, but these don't move at all).  Otherwise the seats were reasonably comfortable.  The screen is IMAX (i.e. huge), and the sound was reasonably good.  \n\nThey could have put a little more slope into the auditorium seating.  In other IMAX theaters I've been in it seemed the heads of people in front of you NEVER block any portion of the screen.  But I found a few were just slightly into the bottom of the screen.  It wasn't bad, but given my other IMAX experiences I did notice it.", "type": "review", "business_id": "LDJhwZN14AZOJyHjg2lkRw"}
{"votes": {"funny": 3, "useful": 3, "cool": 2}, "user_id": "yy1SbjeyWiAhWfSr5d0new", "review_id": "GOconNmWgg6cJbgwSwrozw", "stars": 5, "date": "2009-08-06", "text": "Alright, I have been away from Yelp for quite some time, and I feel that this place is fitting to be my comeback review...\n\nChicken and Waffles.  Yes, chicken and M'Fin waffles.  \n\nIn the ghetto?  Check\nHas sweet tea?  Check\nHas no-nonsense, quick service?  Check\nRidiculously long wait?  Check\nBest thing that I have eaten in the last year?  Check\n\nI have to say, not the best fried chicken I have ever had, but pretty damn good- it could use more seasoning.  Now the waffles, probably the best ever...  The waffles are deliciously soft inside, a little crispy out with a wonderful cinammoness to them.  The seating is cramped, but it doesn't matter as soon as your food is delivered your table goes quiet, you get tunnel vision and after the first bite you are taken away to an orgy of goodness.\n\nIf you are in Phoenix, this is a requirement.  Come real early or be prepared to wait.  Don't forget to order the Red Velvet cake and they have Kool-Aid if that fits your fancy.  Even after I came home from Arizona, I couldn't stop talking about LoLo's for like 2 weeks.  Shoot, two months later and I am still drooling thinking about it...", "type": "review", "business_id": "K8pM6qQdYu5h6buRE1-_sw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "40aklZ2SQPKnlTPZdvAqww", "review_id": "6jRs2P6zTYMn36fVnCu1Zw", "stars": 4, "date": "2012-01-14", "text": "In our continuing quest to identify cool, locally owned places to eat and/or drink, Caroline and I auditioned Vintage 95 last night. \n\nBefore I go further, understand that whenever I go out for eats or drinks, I have  in  mind a Platonic Ideal of the Bar/Pub/Eatery I most want to frequent. I'm on a constant quest to find that  Ideal expressed in Real Life. \n\nVintage 95 isn't quite there, but it's damn close. If I ever give something Five Stars, you'll know it has pegged my Platonic Ideal. Anyway...\n\nThe plan last night was for drinks. No plans for food, just Adult Beverages and warm conversation. But it turned into more.\n\nThe location in downtown Chandler is terrific for us. The owners have created a very fine visual experience - leather, stone, dark woods, good lighting. And they don't have the music turned up so loud that you CANNOT HAVE A CONVERSATION. This is one of my pet peeves. If I want to stare at people move their mouths while enduring an aural assault, I'll stand on the deck of an aircraft carrier. When I go out with friends, I want to enjoy their company AND their conversation. Is that concept so difficult to grasp? [/rant off]\n\nThe atmosphere at Vintage 95 is very close to my Ideal. I'd go back just to sit on the leather couches in front of the fireplace, and then go back another time to sit on the leather stools at the bar, and then go back about fourteen more times to sit out on the patio. Seriously - go check out the patio. It is EXACTLY what a Patio Hangout Bar should be. EXACTLY.\n\nCaroline and I told the hostesses we were only there for drinks, so we were seated in the bar area in some fabulous leather club chairs. It wasn't initmate, but we weren't looking for intimate. And speaking of the bar, even though V95 advertises itself as a wine bar, they DO have booze. I'm not much of a wine drinker and was very pleased to see that they carried a pretty good selection of single malt scotches. Not an overwhelming selection, but well beyond the normal Glenfiddich /Glenlivit /GlenMorangie trio to which most places are limited. I had a couple of drums of Ardbeg, which is one of my new favorites and very reasonably priced at retail. (Scotch is never reasonably priced in restaurants, but I was celebrating so I didn't care.) Caroline had her normal \"vodka martini extra dirty extra cold\" which she judged to have \"perfect dirtiness\", (no wonder I love her!), perfect amount of olives and very cold. \n\nThe limited Happy Hour menu had some very interesting choices. We settled on the bruschetta and the smoked tomato bisque. The bruschetta was VERY nice and quite unusual. You get to select four of eight choices for your bruschetta platter; we picked: (1) white bean and pancetta, (2) gravlax, caper goat cheese and pickled onions, (3) fig chutney, ricotta and prosciutto, (4) brie, pear and onion jam. They were all served cold, in nice sized portions and the flavors were all nicely balanced and very interesting. Caroline would have preferred the bread to not be so crispy, but I really liked it. The tomato bisque  was creamy, smoky and had well-balanced flavor. Caroline said it was unique and I say it was just darn delicious. \n\nThings being as they are, drinks and appetizers turned into food. A friend had told us \"you have to try the Vintage burger\", so we did. It came served with a mixture of regular and sweet potato fries, all nicely cooked and nicely seasoned. Recommended. The burger was VERY tasty. They obviously use good beef, the bun was fresh, the fixin's were tasty. HIGHLY recommended.\n\nIn for a dime, in for a dollar, right? So we ordered dessert. Again, the dessert menu is short, but I'm okay with that as long as they do it well. Chocolate torte with hazelnut gelato, apple pie with carmel sauce and creme fraiche gelato, and something else we couldn't remember. I'm allergic to hazelnut and don't like sweet desserts, so we decided to try the apple pie.\n\nLike everything else we had sampled, the apple pie was unusual - you wouldn't find it anywhere else. It was served on a freshly baked puff pastry, cubed apples served on top and inside - tender but not mushy -  with lots of cinnamon and sugar, plate was swirled with salted dolce la leche. It was tasty, but instead of the expected creme fraiche gelato, we were served hazelnut gelato. I didn't realize it was hazelnut until I'd had a couple of bites and my throat started to swell up.\n\nAt this point that the night could have turned into a disaster, but to their credit - it didn't. We told the waiter who told the manager, (Gavin - one of the owners), who immediately came and asked if I needed emergency assistance. I didn't, I'm not THAT allergic.)  Frankly, their response was EXACTLY the kind of customer service you want to see. Anyone can make a mistake, so no harm, no foul. But I must give BIG Kudos to Gavin for his kindness, attention to detail and outstanding customer service.\n\nWe will DEFINTELY be back and I strongly recommend you put it on your list too.", "type": "review", "business_id": "FCcFT610nQBVcRdY-devQA"}
{"votes": {"funny": 2, "useful": 2, "cool": 1}, "user_id": "UL9chyH0a4Pj8J_9M6WSpA", "review_id": "VyX6x7wnThr9g9Z6VBDIgA", "stars": 2, "date": "2009-09-02", "text": "I have to add to Andrew's review.....\n\nI just can't believe the things that happened!!\n\nYes the app was good.  The entree was good too, but there were bites of just bread with no chicken in the panini.  It definitely would have been better with more chicken!\n\nBut the girl working here is one of the worst waitress/bartender/hostesses EVER!\n\nWhen we walked in, she didn't even sit us.  We stood there forever waiting until she finally told us to seat ourselves.  We went outside since there was nothing left inside.  It was too hot outside so we came back in and figured we'd sit at the bar.  Luckily a nice guy noticed us looking around and let us sit at the end of his table that he moved apart since his whole party didn't show up for dinner.\n\nI was so excited when I saw they had cider on their menu!  And not just one, but two that I like!  Wyder's Pear Cider and Strongbow!!  \nI ordered a Wyder's.  After I finished it and asked for another, she said they were out of them.  Okay, so I ordered a strongbow.  She came back and poured it into a glass for me.  When I took a drink it was disgusting!!  It was Boddington's!!!!  When I finally got her attention away from flirting with a man sitting at the bar to ask her for the correct drink, she told me they were out of Strongbow too!  How are you out of both drinks??  You're a restaurant.  Shouldn't it be stocked?  You're right across from a BevMo for god's sake!\n\nWhen we ordered our food, he ordered the app.  Then I ordered my entree and she walked away!  She didn't even get his order!!!!  We figured it was probably for the best.  We'd split the app and the entree and eat less.  Stupid of the waitress to lose money that way, but whatever.\n\nWhen she brought my food, she didn't bring the correct things.  How hard is it to remember?  She had maybe 4 tables to take care of!  Maybe if she stopped texting while she's behind the bar on her cell phone or if she'd stop having a conversation with the guy at the bar, maybe she could have done her job a little better.", "type": "review", "business_id": "tA2DT7CGQPzgA6tTcTkXDw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xw77viWz_BbmyntxoBVH4A", "review_id": "IRGqHYbK5AOEv5MNYMz7cQ", "stars": 4, "date": "2010-02-04", "text": "This would most certainly be \"my\" coffee shop if I hadn't already established myself as a regular at another local shop. This brand-new, independent coffee shop has spent the money to look really nice (it even has a fountain inside!).\n\nBut what money can't buy is community and unfortunately this shop doesn't seem to have much of that. Granted, building community takes time and/or energy. For their sake, I really really hope it works out in the long-run.", "type": "review", "business_id": "o5x6DF0KK1OBsiUOx2gavg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "uA18GuF_ezOH6tXkrrykbw", "review_id": "9CXNIZTV9uStuNbvvFS8uw", "stars": 4, "date": "2010-04-24", "text": "No matter what I order I know it will be tasty. Maizie's have a lot to choose from which can be a little overwhelming for me. I love their wait staff everyone is always friendly. When I am in Maizie's I feel like I am in a neighborhood hang out.", "type": "review", "business_id": "AaKlegu7gmOCD4rEESF76Q"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "U3uT-Phb8iL2iuZpAROZlg", "review_id": "nzSOTOZiAb1ITqbRgWKnnQ", "stars": 5, "date": "2010-09-28", "text": "This restaurant is incredible, and has the best pasta carbonara and the best tiramisu I've had in my life. All the food is wonderful, though. The calamari is not fried. The bread served with dinner comes right out of the oven, and the tomatoes are the freshest I've tasted outside of my mom's own garden. This is great attention to detail.\n\nI can no longer eat at any other Italian restaurant without feeling slighted. This is the first place I want take out-of-town visitors I'm looking to impress.\n\nThe owner, Jon, is helpful, friendly, and really cares about providing a positive dining experience. He's spot on with his wine recommendations, and he organizes wine tasting events which you can find out about by joining the mailing list or Facebook page.", "type": "review", "business_id": "E6DnUFy3GoN4DxTqturtug"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "wJzMpk54FF2jeENqMBJ24Q", "review_id": "9BJJwIciVG-JPlXetInbXw", "stars": 4, "date": "2012-06-08", "text": "One of the spot my coworkers and I go to for lunch. We usually try to get there before 11am (weekdays) to beat the rush from all the Corporate places near the MetroCenter.  \n\nThe deli sandwiches are good.  I usually stick to getting the Amy's turkey-O.  If you plan on substituting a side, make sure you tell them because the cashiers don't normally ask and you'll be stuck with chips.  The salad bar here is very decent for the price.  \n\nDon't forget to get ice cream on the way out!", "type": "review", "business_id": "znBnrQNq1FdUt5aIGAbyuQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "EPROVap0M19Y6_4uf3eCmQ", "review_id": "DJVxOfj2Rw9zklC9tU3i1w", "stars": 1, "date": "2011-11-22", "text": "I have always been a fan of Burlington's deals, however I will not be shopping at this one again. I went to return a belt... pretty simple. Instead, I stood in the customer service line for 15 minutes thanks to an employee of Burlington buying/putting things on layaway. It took three other staff to help her out. There were no words said to me except \"Hold on\". I was pissed. When the lady was finally done, the employee at the service asked \"what do you want?\" Serious help is needed there!\n If you work in the area of \"customer service\" I think you should have some.", "type": "review", "business_id": "l4vBbCL9QbGiwLuLKwD_bA"}
{"votes": {"funny": 1, "useful": 2, "cool": 0}, "user_id": "gTCM7qlVrwdml-hFB6aJqQ", "review_id": "J2Ig5cV9fJU-KGewdzQXOA", "stars": 3, "date": "2008-01-28", "text": "If I could give 4 stars for atmosphere and 3 stars for food I would.\n\nWith all the hype of getting a Margaritaville I guess was expecting a little more in the way of Margaritas and cheeseburgers. But I was underwhelmed with both. You can get a much better burger next door at Yardhouse and a much better selection of Margaritas from Salty Senorita. With that aside this place is quite the spectacle. It has 2 stories, a stage, fishing boat booths, and every other piece of decor that a Parrothead could love. TV's broadcast Jimmy himself rocking out and some odd montages of Parrothead outings. Live music is offered here several nights of the week and they offer 2-3 bar areas. If defiantly won't become part of the regular rotation but from time to time we might wonder in looking for our lost shaker of salt.", "type": "review", "business_id": "YeDYa6tYL16CyqYvUVOtLw"}
{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "nM3vfxr6fcnN_nXdzwbVCw", "review_id": "rghv_qgXpluzDE9qn8CNrw", "stars": 4, "date": "2010-02-05", "text": "It is romantic here even if you are with just friends. The waitress kneels at the couch to speak with you, pour your wine, bring your check...I love that...its so 5 star and respectful. Our waitress was so friendly and I was on cloud 9 because the whole ambience made my evening so nice. I love the darkness of it, its all so exotic and relaxing there especially with all the coves and different areas to be seated. Apparently you have to put your name down if you want a table for certain as it seems to be packed anytime I have been there. We needed one more bar stool-we had no reservation and the waiter actually went \"out to the storage\" to get us one. Impressive!", "type": "review", "business_id": "P5uC-zfGG6yqoQDUyqyAvg"}
{"votes": {"funny": 2, "useful": 1, "cool": 0}, "user_id": "MjLAe48XNfYlTeFYca5gMw", "review_id": "GXj4PNAi095-q9ynPYH3kg", "stars": 1, "date": "2012-05-19", "text": "Another night meeting friends here.  I have to laugh.  Waited another 20 minutes for my beer to be refilled at the bar.  A girl even took my empty without even asking if I wanted a refill.  A new brunette girl that I don't recognize left the bar and sat down with her guy friends on the customer side AT 9:25 ON A FRIDAY NIGHT.  Another bartender had to ask her to come back and work.  Management....  Pull your head out of your ass!  Sad to watch....  I need to talk my friends into another place!", "type": "review", "business_id": "CEswyP-9SsXRNLR9fFGKKw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "rWN1pg3mCF2btJWtG6JmJA", "review_id": "LN4l4wklQB0IVBjm-vq9TA", "stars": 1, "date": "2011-05-04", "text": "Not busy at all but took nearly 45 min to get our meal.  Ordered the trout and was shocked to see lots and lots of bones. Hmmmmm. Well asked the waitress about it and she said \"they try the best they can\"  hmmmmmm isn't this a \"fish\" restaurant? \nThey comped the trout but still not sure I would go back.", "type": "review", "business_id": "6Ry-gjGqApTSRZkfdYlLmw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "0jJhjgr3wPin-8vYnPab6A", "review_id": "L_q9kLaGo33j2Ij8yUIGDw", "stars": 5, "date": "2011-12-30", "text": "This an incredible church that embraces the principle that ......Christ Life Church exists to bring people into a life-changing relationship with Jesus Christ.  Three campuses allow Christ Life to reach into several locations...online, Tempe and Casa Grande.   The wonderful children's and youth programs appeal to a wide perspective of people.", "type": "review", "business_id": "taSsiZAGZSz2gRg7_M4XDw"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "-yg_AMAU2HNh48zcuQ13mw", "review_id": "dY_p1YkjZxJmREb9Lfc5vw", "stars": 5, "date": "2011-04-28", "text": "This is our favorite breakfast place. The food is good. They have the best biscuits & gravy of any restaurant I have eaten at. The wait staff is friendly. The only complaint I have is that Sunday mornings are packed, so there can be a wait to be seated.", "type": "review", "business_id": "3oLy0rlzRI_xiqfQHqC4_g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "UHyDQ-laihWMGa8MtIToOg", "review_id": "mTcLzmYunqJIGKgklFWICg", "stars": 4, "date": "2011-08-14", "text": "The best sweet and sour soup ever!  Food is delicious and favorable.  Delivery is pretty good, nice people.", "type": "review", "business_id": "0QTn4pMzKv1mnQifcP9YoQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "xP3o3-r0KRUnZqBSdIGJjw", "review_id": "-_hed9F2kUDdb4oa1CXKIA", "stars": 5, "date": "2012-01-05", "text": "I had looked at several invitation websites along with catalogs with no luck in finding just the right balance of wedding colors/design.  Thomas at Alphagraphics helped me every step of the way of designing and printing our wedding invitations and programs.  I knew I wanted a booklet-style, but needed a little design creativity from Alphagraphics which they nailed!  I highly recommend Alphagraphics to anyone needing any print work done - not just wedding invitations.  Thomas and his crew are stellar!!", "type": "review", "business_id": "N5iW2JG5e-QyUh7brRNSfw"}
{"votes": {"funny": 0, "useful": 3, "cool": 2}, "user_id": "XqMkm-DD9VsdcKx2YVGhSA", "review_id": "xNvNTC2iXwJiiujNK6Sphg", "stars": 4, "date": "2010-05-22", "text": "Every now and then my Vietnamese side craves for PHO...are you surprised!?  Noodle Ranch is my local Pho joint.  I can literally walk to this place :)  Okay, the Pho Tai is great here....I got the combination once and it wasn't as good.  I love the decor here lots and lots of old photos of Vietnam.  Service is always good here and I've been here when their busy and when it's slow.  If you need a Pho fix I would definitely recommend this place!", "type": "review", "business_id": "_HTE4pOKeJC7kcxiCF9vTA"}
{"votes": {"funny": 1, "useful": 6, "cool": 0}, "user_id": "5je-Jg8tq5BWxJtDBmTK2Q", "review_id": "jNewOjPp56NMDrKlajrgFQ", "stars": 1, "date": "2011-04-23", "text": "Yikes, reading other reviews I realize my bad experience wasn't unique. As a server I make a very laid back customer. I like pretty much everything I eat and don't require a lot of attention from the waiter. \n\nLa Piccola Cucina would benefit from just one extra person in the front of the house. Our guy, though adorable and friendly, was too busy to refill our drinks and to remember to bring our appetizer (though charged us for it). The ahi tuna (highly recommended over the other fish options he said) was so overcooked it was the color and consistency of chicken. Like other reviewers mentioned, he was frantic and made that clear to every customer. At one point I even saw him in the kitchen cooking - they need another person! \n\nI left super stressed out from the experience, which is very, very unusual for me. You can either have bad service or bad food, but not both.", "type": "review", "business_id": "NNGJQF3WeIHzGzweCpZ-VA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "IE_nJq65Qpso5fN4tG9zjQ", "review_id": "WONOXuKoiT2hkKITvTfC0g", "stars": 4, "date": "2008-04-25", "text": "This is your typical Buffalo Exchange. I've been to others in San Francisco and San Diego, and they're all pretty much the same. Yes, they're super picky brand name whores about what they buy from you, but it means that there are some really great items for a much smaller price tag. I've gotten dresses that people always compliment and things that I've bought on impluse because I thought it was a great buy, and wore once. \n\nThe building this one is located in leaves a lot to be desired, but  there are good buys inside. I walked away with a great pair of skinny jeans, a cute top, and a super comfy dress for under $50 =).", "type": "review", "business_id": "3HciJAVduCRoPDdzgh7cAA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "t8vH6ubd-6i9DTisZaQdgg", "review_id": "IC2EAv_PGx44FnTvfAs_FA", "stars": 4, "date": "2008-06-23", "text": "Though perhaps not the place you may pick for a special brunch with champagne and chocolate brioche French toast (a signature breakfast at the Sofitel Philadelphia), the Good Egg is my choice for neighborhood breakfast that offers consistent service and food in a comfortable atmosphere.\n\nNo matter how busy the restaurant becomes, and on Sunday it is packed,  the staff is always friendly and welcoming. You may have to wait for a table but the waits are never excessive and there is the coffee trolley where you can help yourself while waiting.  Even more remarkable is that even at its busiest (read Mothers/ Fathers days), service is speedy and attentive and the kitchen never seems to slow down.  Someone here knows how to run a restaurant!\n\nThe menu contains a large assortment of the usual breakfast fare, eggs, pancakes, french toast, etc, all well prepared and tasty.  In addition there are is a good number of health conscious offerings and even those less healthy dishes can be requested to be made with egg whites or egg beaters, and non-starch substitutes (cottage cheese, fruit, and tomatoes. etc).  Some of my favorites include the Hey Ricky Omelet, Huevos Ranchero ,or my indulgence a (as in one huge singular)  buckwheat pancake with (my choice of \"fillings): chocolate chips ( I admit my addictions), pecans, and bananas... \n\nWe always opt for the patio and even in the scorching summer heat; the misters make this a great outdoor picnic with the best people watching in Phoenix.\n\nAfter you have been here a few times you feel like part of the family and with their frequent dinner program they offer even more incentive to return.", "type": "review", "business_id": "4meJyPOhuAKzywUJTmu2hw"}
{"votes": {"funny": 1, "useful": 7, "cool": 3}, "user_id": "iwWBF3nKoRMoy1sbkLJwvg", "review_id": "SWdrx60taMa442b1enwfCw", "stars": 5, "date": "2008-06-13", "text": "I absolutely love this little spot! It's a great little known boutique with incredibly unique gift items that I don't have to drive clear out to Scottsdale to find. I've been shopping at Vignettes for about 8 years. Whenever I am in a quandary about what to get someone, this is the first place that I head to. Mostly it is because of the wide range of specialty items that they have on hand. Whether it's something for the garden, a gift for the new bride or baby, a unique piece of art, or heavenly scented candles - you will not be disappointed.\n\nThe owners / staff are super friendly and have always been more than willing to help find something within a price range or based on occasion / need. And they do the most amazing wrap jobs, making gift giving even easier.\n\nThe final bonus is their annual Clearance sale. For three days each year they basically blow out their stock to make way for new finds. Ask to be put on their mailing list to ensure your have a heads up and get there early because long time customers like myself never miss it. : )", "type": "review", "business_id": "pRmHreZcF7YmNEEPukfcFg"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "BUeMRVgAQvBWnnrI2xcA1Q", "review_id": "UxzU0E5eM_ZgIMus-wpS8g", "stars": 4, "date": "2010-09-21", "text": "Great Southwestern restaurant.  The food is incredible, especially the stacked enchiladas.  Normally I do not eat heavy foods, but this was way too good to pass up.  The chips and salsa were very tasty as well.\n\nService was very friendly and timely.  The interior is pedestrian at best, but still a pleasant environment.", "type": "review", "business_id": "s9XNBJAZ3ZcNW5u8BRZXuw"}
{"votes": {"funny": 1, "useful": 1, "cool": 1}, "user_id": "GVH_iuoPc0aP3ZNYlWuKag", "review_id": "QqUj8brMiWkMicmlWtpPrw", "stars": 4, "date": "2011-06-24", "text": "Went back to AB a few weekends ago, again for brunch, with a large group.  I was surprised to see that, although they advertise themselves as being a brunch place on the weekends, they have pared their menu down to basically 4 items.  The people that I invited that had never been to AB before were expecting more of a variety in brunch items since I'd told them that they had great brunch, but their concerns were quelled with a few bloody Marys and some good (if not diverse) food.  I had the egg sandwich sans bacon again (excellent again) and Sweet Pea and I split the french toast as well.  We'd only had a small sample of the french toast at the opening, so we didn't realize that it comes with this whole jar of cream and berries, in addition to the syrup.  If you come here for brunch and like french toast, you have to try it.  It's the best french toast I've ever had, and many at our table agreed.  The secret is that they bread it in cornflakes.  Yum.  And, the bloody Marys are in the excellent range, I'd say just below the phenomenal ones at Dick's/Rokerij.  The service was also friendly and quick.", "type": "review", "business_id": "Xq9tkiHhyN_aBFswFeGLvA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "aLTl_OkLo0BFRxdz1n6sYA", "review_id": "gLHPqclZG51HH9EGzOFjxQ", "stars": 4, "date": "2012-09-20", "text": "Great prices, great food. The staff is very friendly... I'll definitely be coming back here for lunch on a more regular basis. I had the kung pao, and the portions were incredible for the $5 I paid. \n\nNot mind blowing, but better than most Chinese places I've been to in the Valley.", "type": "review", "business_id": "ImghNwml8N-ncAqhXe00hg"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "O3huqF3nBeWP9Zd6NmCAaQ", "review_id": "ZXp8gEhfE7BHgRYIgnd3gQ", "stars": 5, "date": "2011-08-18", "text": "Came here with a large group a while back.  We were there to eat and have a beer before a concert there. It was a weekday so we made it to happy hour. Happy Hour pricing was fair. The food was pretty good. The very best thing there is the beer!  They had like everything on tap! MMMM!", "type": "review", "business_id": "cBpJIOrVXotDI0XAZH_k0g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "68exKLCQnnZrvXNFOcIUnA", "review_id": "odua8qFSMEXSFYmElQTspQ", "stars": 1, "date": "2012-09-17", "text": "This is my first year participating in Arizona to sell clothing, just wandering how busy its goona be in there ??? little worried, can any one reply me ??", "type": "review", "business_id": "FkHhy6kWeoJf0xJTqzRWmg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "YBVdmm5zlpLpi2_DiKsd2A", "review_id": "vwHmBJ5YKbZxNFtmP2KpRQ", "stars": 4, "date": "2011-03-28", "text": "The vibe exuding from this place is pure awesomeness. Reminiscent of a trendy hipster coffee joint, this is actually a casual vegan restaurant. \n\nI am a pescatarian and unless I am eating seafood, I steer clear of meat, even the mock kind usually however once in a while it's delicious... so why try it here at Green I thought. The menu's style is comfort food, which as we all know traditionally is heavy on the meat, sauces, and fat content... so at least if you're going to be bad, you can do it with organic and pure ingredients.\n\n\nSo as I wanted to sample as much of the menu as possible, my lovely friend, her fiance, and I shared a few items:\n\n*Artichoke Gratine: The corn chips were amazing, lightly salted and crisp. The dip was a bit too garlicky and runny for my liking. Ate a few bites of this but could not see myself eating the entire thing solo.\n\n*Spicy Buffalo \"Wings\": first things first... do not let looks dismay you... true it looks gross but they taste legit! The flavor of the buffalo sauce was perfect, although could have been spicier. And the cucumber ranch dipping sauce was perfectly creamy and lightly flavored as to not overpower the \"wings\". This dish is a must try!!\n\n*Vegan Chili Fries: the fries are thin cut and tasty. The chili sauce was good, at first, but I quickly got sick of the flavor. This could be because I was never a huge chili fan even back when I ate meat. Hmm, I think you are better off ordering the thyme fries.\n\n*Crab Puffs: Perfectly crisp with a delicious creamy filling. Another must try!\n\nLastly my friend's fiance ordered that day's special which was a green chili burrito... delicious and huge. A bit too much rice but besides that a great option. It came with a side, which he ordered the curry pasta salad, mmm.\n\n\nGreen serves bowls, sandwiches, pizzas, salads... next time I am back in the area I will be checking out more of the menu when craving \"meat\" and not my usual tofu, seafood, veggie diet.  \n\nMight I add the service is friendly. Perfect place for a casual friend date.", "type": "review", "business_id": "c1yGkETheht_1vjda7G5sA"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "gcyEUr4DXcbjnGRAWFtfAQ", "review_id": "BslISEau8Pk2voEPN7kY-g", "stars": 4, "date": "2012-06-29", "text": "Rokerij is worth the hype. We popped in last week for a late bite and left super happy. We scored a few seats at the bar, the place was SUPER crowded (which is a good sign on a Wednesday). I started with a beer called Banana Bread, which was awesome. Wifey had a glass of wine, but I can't remember what it was. We couldn't decide on what we wnated so we ended up splitting the entree of Blackened Salmon with Apple/Chipotle chutney and some potatoes. We also got three of the small Plates: mini reuben, crispy calamari and cilantro rubbed grilled shrimp. All the food was awesome. The salmon was cooked perfectly, although i think I would have liked the chutney on the side, but that's small fries. The calamari was cooked perfectly, the shrimp were awesome (although the bed of rice it came on was meh), and the mini reubens were great as well. I was super excited to try it, and it delivered. Can't wait to go back!", "type": "review", "business_id": "5kRug3bEienrpovtPRVVwg"}
{"votes": {"funny": 8, "useful": 16, "cool": 11}, "user_id": "mfvezpz6ohS0NQk3DZdvqQ", "review_id": "xE2MKvzes5Twg-jfAe8s4Q", "stars": 5, "date": "2009-06-16", "text": "Beer...or Yoga?\n\nLocated in a small center just east of Four Peaks Brewery in Tempe (a reasonable distance from the light rail on Apache), is an amazing, classy studio for the Mind-Body connection.\n\nMr. Mustachio had decided after doing a couple yoga classes with me at the ASU gym that he loved the stretch, so pursued a class for a semester at ASU this Spring and had the pleasure of practicing with Tish Hegel. After seeing his body transform to only 16.2% body fat, all his jeans get too big on him and fill out his American Apparel briefs nicely I was super jealous. He raved about his teacher and I could tell he had de-stressed a lot since he started the practice.\n\nLuckily, she opened up a studio recently, and it simply goregous. The waiting area is filled with yoga material and a very calming space with a remodeled bathroom and dressing rooms to change if coming from work/school. Not at all cheesy like the SouthWest Inst with the way too many angels imagery (creepy!). But the gem is truly the practice space. Hardwood floors, high ceilings, a beautiful staircase, tasteful decorations and absolutely NO MIRRORS.  \n\nThat is right- the only person staring at my pudge rolls is my teacher and who-ever isn't focusing on their tree posture-not the entire class! It really relieves a lot of stress  and helps me concentrate on how a posture feels as opposed to just looks.\n\nAs for Tish Hegel, she is simply outstanding-she has so many credentials, you have to read her biography for yourself. She has been practicing for a loooong time, and her hands-on instruction and confident voice echoes in my ears even now (bring those shoulders down!). \n\nSo far, I have done:  Ashtanga Inspired Flow (pretty intense, really hurt for 3 days, would recommend after getting into yoga for a while), Sivananda (ditto),  Focus Class (did a lot of bike riding and she focused on everybody's body issues and did the sequence right then and there for us and my lower back and knees felt amazing the day after) and this morning brought my friend to Kinetic Yoga: Morning Movement and Flow, which kicked our 6am asses a little bit but we both felt amazing afterwards!  She does tons of modifications, is always making sure we are okay, and is just super personable.\n\nI did the huge package since I didn't renew my ASU gym membership for this summer, but you can do drop-in. \n\nNow for the cliched Yoga Review ending: \n\nNAMASTE!", "type": "review", "business_id": "d7_jkx0VPx3uHsUl18iHMQ"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "qLCpuCWCyPb4G2vN-WZz-Q", "review_id": "bxPZPvBJp5HwyKVHhcUMLQ", "stars": 4, "date": "2010-10-31", "text": "Great hotel in Central Phoenix for a stay-cation, but not necessarily a place to stay out of town and without a car. Not much around the area, and unless you're familiar with downtown, I would rather have a guest stay in Old Town Scottsdale, etc. BUT if you do stay here, it's awesome. Great boutique rooms. Awesome pool that's happening in the summer. A GREAT rooftop patio bar, and a very very busy lobby with Gallo Blanco attached. A great place to stay, but have a car!", "type": "review", "business_id": "8ZwO9VuLDWJOXmtAdc7LXQ"}
{"votes": {"funny": 3, "useful": 1, "cool": 1}, "user_id": "HY9qpAamqLXFoa7xMwNntg", "review_id": "EUCqs_gfKZi1YoKVkWjSYw", "stars": 1, "date": "2009-03-18", "text": "really, I can't believe this place has received such high reviews from people.\n\nmy lady and i walked in, and were greeted rather rudely by a pretentious bitch at the front with a monotone \"name please?\", instead of a warm, friendly, french welcome to this rather charming looking place. we didn't have a reservation, which from the looks of how dead empty the place was, didn't seem like a problem. until the hostess whisked through her reservation list and explained she'd try to \"fit us in\". it was 6pm, the place had one other couple dining, and we were informed that the next party was arriving at 7:30. we weren't really looking to hang out. it would have be awfully lovely if yelpers would have informed of the need to MAKE RESERVATIONS before going in here, because if you don't, you're automatically a piece of shit according to the staff. sorry, i don't plan very much ahead. next time i will, and it won't be here.\n\nanyways, after debating for a minute or two with herself, the hostess decided we could \"squeeze in\" and sat us right on top of the other couple inside the restaurant. she informed us that we could cork our own wine, for their low low price of 9 fucking dollars. in words only office space could adequately describe,\"coup des tartes, what is it exactly that you do?\". \n\nthe food was good, nothing spectacular for $25+ a plate. we got a salad with apples and nuts and bleu cheese, which was served warm. now this is the first warm salad i've had all of my life, and by no means am i some sort of wordly food expert, but i believe salad should be cold and crisp. not soggy and warm. yuck. the cordon bleu was tasty and filling, however, the wobbly table was an extreme annoyance when cutting through the chicken, but it was solved (with no thanks to the staff) by placing a jack-in-the-box gift card under the leg. i will admit, the mashed potatoes are some of the creamiest and best i've ever had. my lady got the pork tenderloin, which had a strange peppery-sweet pairing which i didn't particularly care for. we were broke for desert, so unfortunately we didn't get to try any tarts. you would think for a place that promotes itself as being so poise would get some fancier menus, other than a $.15 piece of cardstock copied in bulk at kinkos.\n\nthis place was rather disappointing. i honestly thought it would be way more comfy and welcoming inside but it really wasn't. it presents itself as being so high class and french and oh-la-la wee wee, but when it comes down to it, it's still located in a tiny shack of a house at 16th street and highland. maybe if it were located in the biltmore i'd give it a bit more cred.", "type": "review", "business_id": "LzpR_jE6VIutJ08s2cdRrw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "P-9g9-6OriX0ElKpZknUKA", "review_id": "1RSEAeAWilUywt1B3SAkSA", "stars": 4, "date": "2012-12-30", "text": "Great place to have a meal with family, can be a little on the loud side cause ita always a busy place, recomend calling ahead and getting name put on waiting list, reservations party of six or more only price range moderate, but well worth it", "type": "review", "business_id": "5GpvSL1tlAjpgdJKZ5eLpg"}
{"votes": {"funny": 0, "useful": 1, "cool": 2}, "user_id": "qT17WVkJi0RvQ4nNPN6NDw", "review_id": "pyCM8bH0z8fp6cWg6f2hKQ", "stars": 5, "date": "2011-04-22", "text": "Figured it is time to write a review after going here for quite a few years for dinner on special occasions or just to have some of the best seafood and Bone in fillet around. \n\nFirst off you have to understand that the cuts are top quality so you can order almost any steak off the menus and be dazzled by the flavor, which is fantastic to the point that adding anything to it would destroy the integrity of the taste as is.\n I mean the meat is perfection on a plate and this needs no other explaining.\n\nIf with friends or even your significant other you must start with the the seafood tower, which can be order in many different ways to match your appetite and likes. When presented at the table you and your guests will be blown away at the quality of the seafood and rightly so as it is brought in fresh daily.\n\nThe sides are too awesome in their taste and quality and i suggest the Lobster mash or the Maestros Mash potatoes neither of which will leave you hungry in their own right, but often wanting more :) \n\nWine selection is great and the atmosphere is top notch, but topping it with some of the best servers in town makes this one of my favorites for entertaining. \n\nyou will not be disappointed.", "type": "review", "business_id": "O-Xa9GCFWI65YiBD5Jw_hA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "Y9LxzNvQxKwLhy2Zo7R_4w", "review_id": "WD99RuBcxqvYRCFTf_mT3A", "stars": 4, "date": "2009-01-31", "text": "I was only able to play the front 9; my wrist was hurting too much to finish, which is a big deal because I live in IL, and was returning from LA and stopped here specifically to play the TPC. Oh well.\n\nI was a single, and got paired with another. The course was pretty open, but we took our time and enjoyed the round. The front nine, although rarely shown on TV, is quite nice. Definitely challenging enough, and I didn't even play the back tees.\n\nIt was fairly easy to get on, the bar had pretty good food for a clubhouse, and the staff were very helpful. Definitely recommend the TPC.", "type": "review", "business_id": "9lDZ2d6oRpFsSWwDCCDQOw"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "ZoBrIw-7VgCOO30GJVCoOA", "review_id": "aRcp0rlSuAiuF-CDDZx9nQ", "stars": 5, "date": "2010-05-18", "text": "I can't describe to you how amazing these gourmet adult hot pockets taste! They literally MELT in your mouth- a few of my favorites are the Cajun Chicken, Dill Salmon, and the Stilton & Steak---Bon Appetit everyone! And don't forget about the all day everyday-$3 car bombs(you can't beat that price) their happy hour is amazing, too!", "type": "review", "business_id": "vARjqeIkSNsazHltujiq4Q"}
{"votes": {"funny": 0, "useful": 1, "cool": 0}, "user_id": "ASi6ZgbbwXIwU2H24uANmQ", "review_id": "VqNdpXrssjJrC0Z_swPUdA", "stars": 1, "date": "2011-03-15", "text": "I was really excited about this event, maybe my expectations were too high, because I was really underwhelmed.  Very little shade, ran out of water, by the time I got there at 1pm (other obligations) 20% of the vendors were out of food, and by the time I ate my way through some, everyone else was already out.   60 bucks for that?  I don't think so.  \n\nAnd when I mentioned it to \"the person in charge\", he was patronizing, invalidating and kept telling me how happy the chefs were.  Well, I'm your consumer, big guy.  \n\nSorry, Devoured, wish it could have been better. \n\nWhat food I did try, was pretty good.", "type": "review", "business_id": "145SQ_msdQ1yo7J0E63VoA"}
{"votes": {"funny": 9, "useful": 7, "cool": 7}, "user_id": "8tbXmjYGsYFZXk6ppuwRWQ", "review_id": "6iEP6dvHIefVMMnjeDRNcQ", "stars": 1, "date": "2010-07-06", "text": "The beach paradise of Ixtapa-Zihuatenejo awaited us....unfortunately, so did a connecting flight in ARIZONA of all places...\n\nLong story short....1/3 of our luggage did not arrive at our final destination, various articles of our clothing are still missing as well as my cell phone charger...not to mention security forcing us to open sealed containers of my son's baby food and milk for litmus tests...\n\nI looked on the bright side....at least we didn't get deported =)", "type": "review", "business_id": "hW0Ne_HTHEAgGF1rAdmR-g"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "cwm_3br1CTH8IO8ZwWzFLg", "review_id": "CxVOhu043DTW4zPTsQnJPA", "stars": 5, "date": "2012-12-29", "text": "So very Portlandia in its hipsterness and decor. Premium coffee roasted in-house, in the middle of the desert, no less! Who would have thunk it.\n\nBaristas were profesh and friendly. They even warmed up our pastries upon request. Perfectly foamed milk and fruity noted espresso. I hope this place has a long life in Scottsdale, where great coffee is few and far between.", "type": "review", "business_id": "Hgbxen9iKGL4AH6kKgC8YQ"}
{"votes": {"funny": 1, "useful": 3, "cool": 2}, "user_id": "7izaZThzAWk2UjrDTL849w", "review_id": "ZbSLbPWeDfSL1HxyiSRqEg", "stars": 4, "date": "2009-01-21", "text": "This is a little hockey dive-bar located in the Arcadia area.  TV screens hang above the bar & as you look behind the bar you can see the hockey rink and players.  Enternaining as the other review said.  I had Dunkel Hefeweisen and my girlfriend had a Corona.  Good times as a group of kids played Rock Band and sang off-key Nirvana covers.  I like this little hidden place.  Just be prepared - it's your average little bar for the average Joe guy.", "type": "review", "business_id": "yb17xHvhDJthJGS10uhFeQ"}
{"votes": {"funny": 2, "useful": 2, "cool": 3}, "user_id": "H4ewd_HH1DE0Y8RbC_7HbA", "review_id": "pMm0qHdnBWd_PWGyYEOnWg", "stars": 4, "date": "2010-01-23", "text": "Love this place. Actually, today was awesome, because they usually only offer the \"express dozen\" through the drive thru, and the kids didn't want to go in, so the dude behind the speaker actually fulfilled my order as I wanted.\n\nThe only thing that bugs the hell out of me is that they charge for 2 donuts when you get a long john. :-(", "type": "review", "business_id": "0QrA-Klgp1R-GzUr6uJS7Q"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "ziCKT5n58tcVfgksImx0VQ", "review_id": "E6-DKEktgxA_fLEnfguAwA", "stars": 4, "date": "2011-04-15", "text": "I grew up on Empanadas in Panama and I have been hard pressed to find anything close to them in the U.S.. today I found them! \n\nA perfectly crunchy crust and the beef was beautifully spiced. Usually Empanadas are bland and soggy. They did a great job on these.\n\nI usually don't like rice, but the rice and black beans were wonderful. \n\nService was great! I'll be back!", "type": "review", "business_id": "hfl62LX14YqNpG0g0Tj6_Q"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "Gi_ZP3Pjdvc9-a8aS3SH0A", "review_id": "i5Ms8r5AMRa-wcU5-necFA", "stars": 5, "date": "2011-06-15", "text": "Awesome subs clean and friendly well priced.", "type": "review", "business_id": "rRe2eLIQ4MQ7d6vFL26Qdg"}
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "0NckJhx0qXykvvhsm-p7MA", "review_id": "Y8GAudCnbK-05qkFzLsv0Q", "stars": 4, "date": "2009-03-09", "text": "Had dinner and brunch, not on the same day...the dinner was good, although I thought the mandala masala could have used more flavor.  Brunch was great, tried 2 different tofu scrambles and both were very good.  Service is...let's say uninterested -- it's hard to be burdened with angst and chipper.", "type": "review", "business_id": "E8z9E0aFDYwC7KQuEU3GYA"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "thlVIc8s6ZCP37UGMf3yDA", "review_id": "cALYebKb5hygdKHqlQJu2Q", "stars": 4, "date": "2011-04-12", "text": "This is a very interesting place.  Don't go here thinking it will be classy.", "type": "review", "business_id": "yGmdo1ENajB98iryHGoWFw"}
{"votes": {"funny": 0, "useful": 2, "cool": 0}, "user_id": "QAwWrE6LLbVHNtZOoDdRRw", "review_id": "SawdMXLYD5ytRmMFvY4nmA", "stars": 5, "date": "2011-03-20", "text": "I LOVE Chic Nails!\n\nI used to go to Tip & Toes on 48th street and Ray Road, until one day they were \"too busy\" to take my friend and I in for pedicured. We discovered Chic Nails and have been doing all of our manicures and pedicures there since. \n\nThe staff is extremely friendly and they give the best pedicures for a very reasonable price. I highly recommend this nail salon over any other!\n\nP.S. It is extremely close to CK's Bar & Grill to go for happy hour after! :)", "type": "review", "business_id": "QGeliKMObpVZ3jP89--ZIg"}
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "v10WwWFKPAK6aKjghrLj3g", "review_id": "j-jMQdELr6AFkCcEHxB7ww", "stars": 5, "date": "2011-03-06", "text": "After the Padres Spring Training game, we had reservations at Don & Charlie's in Scottsdale .  None of us had been here before and it came highly recommended by my dad.  As soon as you walk into Don and Charlie's your eyes start feasting on all the signed baseballs down the left wall.  Now everywhere you look from floor to ceiling and even the ceiling itself is covered in memorabilia and autographed items from athletes of all sports and other celebrities.   Besides the amazing assortment of sports artifacts, I especially like the Cactus League Beer List which pairs a beer with each city that has a team in the Cactus League.  Colorado = Coors Light , Texas =Shiner Bock, Chicago =Old Style, and San Diego =Stone IPA, etc.  Also worth mentioning is the complimentary chopped liver platter with rye bread and bagel chips they bring as soon as you are seated.  I had the ribs with coconut shrimp combo which was great. I wasn't thrilled with the side dish: potato's au gratin which is a $2.50 upcharge.  They also bring a huge bowl of cole slaw with each entrée or you can choose soup which comes in a smaller bowl than the cole slaw!  We were too full for dessert and as we walked out, this place was packed!  I found myself trying to take in as much memorabilia as possible and then on one side of the crowded lobby there sat Willie Mays himself.  He was signing his book (or a baseball) for a $200 charitable donation to his foundation. Needless to say, I 'm not bringing home any memorabilia myself!", "type": "review", "business_id": "bc-lE-wGVAsUrX-kJhtY-Q"}
